fred = "почему у горил большие ноздри? потому что у них тостые пальцы!"
print(fred)
#  присвоение переменной значение строки

fred = 'что это: розовое и пушистое? розовый пушистик'
print(fred)
# строка может заключатся в одинарные ковычки и результат не изменится

fred = '''что едят на полдник динозавры
Триекс - кекс'''
print(fred)
# Тройные одинарные ковычки позволяют переносить текст

silly_string = '''Тут что-то не так, не будь я д'Артаньян", - подумал он.'''
print(silly_string)
# этот пример показывает как можно использовать одинарные тройные ковычки в строке для игнорирование использования в ней в нутренних ковычках

single_quote_str = '"тут что то не так не будь я д\'Артаньян". - подумал он.'
double_quote_str = "\"тут что то не так не будь я д'Артаньян\", - подумал он."
print(single_quote_str)
print(double_quote_str)
# указаны варианты экранирования (\) спомощью экранирования можно блокировать ковычки

myscore = 1000
message = 'мой счет: %s очков '
print(message % myscore)
# в этом примере показанно использование переменной внутри строки спомощью '%s' и так же показанна позиция где нужно отобразить эту переменную

joke_text = '%s: приспособление для поиска мебели в темноте'
bodypart1 = 'колленка'
bodypart2 = 'лодышка'
print(joke_text % bodypart1)
print(joke_text % bodypart2)
# в этом примере  показанно примемение оператора %s к первой переменной и применение при выводе % для задействия второй или третей переменной

nums = 'что сказала число %s  числу %s ? Славный поясок'
print(nums % (0,8))
# в этом примере показанно что в одной строке может применятся несколько операторов %s ВАЖНО: привыводе указывать значение в скобках именно в том порядке как и встроке

print(10 * 'a')
#  показанно умножение строки

spaces = ' ' * 25
print('%s Задний переулок 12' % spaces)
print('%s Трясогусочая пустош' % spaces)
print('%s Западный Всхрапшир' % spaces)
print()
print()
print('Уважаемый сер')
print()
print('хочу сообщить вам, что кое-где на крыше уборной')
print('не достает кусков черепицы')
print('Думаю, прошлой ночью их сдуло внезапным порывом ветра.')
print()
print('с почьтением')
print('Малькольм Конфузли')
# данный пример показывает переменную spaces для перемещение первых 3 строк на указанное значение

print(100 * 'слякость')
# Спам через умножение строки

wizard_list = ['поучии лапки', 'жабий палец', 'глаз третона', 'крыло летучей мыши', 'жир слизня', 'перхать змеи']
print(wizard_list)
# в данном примере показан объект список