print(8 * 3.57)
# Умножение

print(10 * 365)
print(3650 + 20)
# повторение вычеслений с использование оператора умножение и сложение

print(3 * 52)
print(3670 - 156)
# вычесление с использование умножение и вычетания

print(3514 / 5)
# вычисление с оператором деления

print((5 + 30) * 20)
# вычисление с использование скобков для выделение области которая будет выполнена первой в обход приоритета оператора(* / над операторами + -)

print(((30 * 20) / 10) + 5)
# вычисление с использование вложенной области где сначала выполняется вычисление во внутренних скобках потом во внешних

fred = 100
print(fred)
# присвоение значение к переменной

fred = 200
print(fred)
# изменение значения переменной

fred = 200
jon = fred
print(jon)
# переменная имет значение а второй переменной присваивается значение переменная

number_of_coins = 200
print(number_of_coins)
# присвоение другого имени переменной

print(((10 * 365) + 20) - 3 * 52)
# пример сложного примера из книги: print 20 + 10 *365. print 3 * 52. print 367 - 156 в пайчар требуется закрыть указанные варианты в скобки
# второй пример прописования этого же вырожения в однострочном варианте выглядит как: 20 + 10 *365 -3 * 52 пайчар данное вырожения требует корректировки по указаному выше варианту

found_coins = 20
magic_coins = 10
stolen_coins = 3
print(((magic_coins * 365) + found_coins) - stolen_coins * 52)
# вырожение с текстовыми переменными с присвоением цифрового значения